#include <stdio.h>
/*计算两个矩阵的乘积，第一个是2*3矩阵，第二个是3*2矩阵，结果为一个2*2矩阵。
输入
输入包含多组数据，先输入一个2*3矩阵，再输入一个3*2矩阵。
输出
输出两个矩阵的乘积。*/
int main() {
    int a[2][3],b[3][2];
    int c[2][2];
    while (scanf("%d%d%d", &a[0][0], &a[0][1], &a[0][2]) == 3) {
        scanf("%d%d%d", &a[1][0], &a[1][1], &a[1][2]);
        scanf("%d%d", &b[0][0], &b[0][1]);
        scanf("%d%d", &b[1][0], &b[1][1]);
        scanf("%d%d", &b[2][0], &b[2][1]);
        c[0][0] = a[0][0] * b[0][0] + a[0][1] * b[1][0] + a[0][2] * b[2][0];
        c[0][1] = a[0][0] * b[0][1] + a[0][1] * b[1][1] + a[0][2] * b[2][1];
        c[1][0] = a[1][0] * b[0][0] + a[1][1] * b[1][0] + a[1][2] * b[2][0];
        c[1][1] = a[1][0] * b[0][1] + a[1][1] * b[1][1] + a[1][2] * b[2][1];
        for (int i = 0; i < 2; ++i) {
            for (int j = 0; j < 2; ++j) {
                if (j == 0) {
                    printf("%d ", c[i][j]);
                } else {
                    printf("%d", c[i][j]);
                }
            }
            printf("\n");
        }
    }
    return 0;
}
